package practice13

fun main(args: Array<String>) {
    //90 БОЧОНКОВ, в случайном порядке, ПЕРЕД ИГРОЙ shuffle, не повторяются

    //ИГРОВАЯ КАРТОЧКА 3х9 (3 ряда, 9 столбцов). В каждом ряду только 5 занятых ячеек.
    //Пустые клетки для игры не предназначены.

    //ЯЧЕЙКА с рандомным числом от 1 до 90 включительно. Числа не могут повторяться.
    //по желанию можно расположить числа в ячейках в порядке возрастания

    //Правила игры
    //- Каждый из игроков берёт себе одну или несколько КАРТ, причём количество игровых карт у каждого из игроков должно быть одинаковым.
    //-Ведущий достаёт из мешка один из бочонков. Каждый игрок проверяет, есть ли такое число на его игровых карточках. Если объявленное ведущим число есть на игровой карте, игрок закрывает его специальным маркером. Если такого числа нет, то игрок ждёт объявления следующего числа.
    //-Бочонки достаются до тех пор, пока один из игроков не выиграет.
}